OpenFOAM-3.01/tutorials/liquid_Jet/struct_mesh/constant/pdfDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      pdfDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Number of intervals/bins in pdf plot
nIntervals      20;

// Number of samples
nSamples        10000;

// Type of pdf
type            RosinRammler;

// Write data flag
writeData       true;

// Points where collect
points	(	(0.001 0.0 0.0));

// Number of Stochastic Fields
nFields		16;
// PDF model coefficients
RosinRammlerDistribution
{
    minValue        1e-06;
    maxValue        200e-06;
    d               60.0e-06;
    n               0.8;
}

// ************************************************************************* //
