OpenFOAM-3.01/tutorials/liquid_Jet/struct_mesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletL
    {
        type            kleinInflowGenerator;
        perturb         1e-06;
        correlationShape gaussian;
        gridFactor      1;
        turbLenghtRatio 0.3;
        diameter        0.0001;
        umean           79;
        turbIntensity   0.15;//0.2;
        readExp         0;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    lateral
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    wallInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
