OpenFOAM-3.01/tutorials/liquid_Jet/struct_mesh/system/BKPblockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.146;
convertToMeters 0.001;

vertices
(
	(0 -1 -1)//0
	(3.5 -1 -1)//1
	(3.5 1 -1)//2
	(0 1 -1)//3
	(0 -1 1)//4
	(3.5 -1 1)//5
	(3.5 1 1)//6
	(0 1 1)//7
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (128 512 1) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (62 65 64) simpleGrading 
	(
		6.06835                  // x-direction expansion ratio -- 1.03 cellToCellExpRatio
		 (
		  (0.475 0.46154 0.46778)    // 45% y-dir, 45% cells, expansion = 4
		  (0.05 0.07692 1)    // 10% y-dir, 10% cells, expansion = 1
		  (0.475 0.46154 2.13775) // 45% y-dir, 45% cells, expansion = 0.25 (1/2.566768)
			/* Questo per 2 mm di larghezza e 10 micron
		  (0.475 0.42 0.11932)    // 45% y-dir, 45% cells, expansion = 4
		  (0.05 0.16 1)    // 10% y-dir, 10% cells, expansion = 1
		  (0.475 0.42 8.380596) // 45% y-dir, 45% cells, expansion = 0.25 (1/2.566768)
			*/
		 )
		 (
		  (0.475 0.46154 0.46778)    // 45% y-dir, 45% cells, expansion = 4
		  (0.05 0.07692 1)    // 10% y-dir, 10% cells, expansion = 1
		  (0.475 0.46154 2.13775) // 45% y-dir, 45% cells, expansion = 0.25 (1/2.566768)
			/* Questo per 1 mm di larghezza e 10 micron
		  (0.475 0.42 0.11932)    // 45% y-dir, 45% cells, expansion = 4
		  (0.05 0.16 1)    // 10% y-dir, 10% cells, expansion = 1
		  (0.475 0.42 8.380596) // 45% y-dir, 45% cells, expansion = 0.25 (1/2.566768)
			*/
		 )
	)
);

edges
(
);

boundary
(
	inletL //seconAirInlet  Blocchi attorno
	{
	type patch;//wall;//
	faces
	(
	(0 3 7 4)
	);
	}

	outlet 
	{
	type patch;//wall;//
	faces
	(
	(1 2 6 5)
	);
	}

	lateral
	{
	type wall;//patch;//
	faces
	(
	(0 3 2 1)
	(3 7 6 2)
	(5 4 7 6)
	//(4 7 6 5)
	//(0 4 7 1)
	(4 0 1 5)
	);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
