OpenFOAM-3.01/tutorials/liquid_Jet/struct_mesh/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
	Sdev
	{
		create true;
		field Sdev;
		aliases{ am alpha.waterPrime2Mean; }
		expression "sqrt(sqrt(sqr(am)))";
	}
);





// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

